In [1]:
import pandas as pd
import numpy as np

In [3]:
#Series = Coluna de um data frame

In [3]:
s1 = pd.Series(['Guilherme','Andre','Pedro'], name = 's1')
s2 = pd.Series(['Iago', 'Filho', 'Paiva'], name = 's2')

In [8]:
s1

0    Guilherme
1        Andre
2        Pedro
Name: s1, dtype: object

In [9]:
pd.DataFrame(s2)

      s2
0   Iago
1  Filho
2  Paiva

In [4]:
pd.DataFrame([s1, s2]) #!Error : Passar as Series como listas volta as Series como linhas

            0      1      2
s1  Guilherme  Andre  Pedro
s2       Iago  Filho  Paiva

In [11]:
pd.DataFrame({s1.name : s1, s2.name: s2}) #Passar as Series como dicion√°rios volta as Series da maneira correta, como colunas

          s1     s2
0  Guilherme   Iago
1      Andre  Filho
2      Pedro  Paiva

In [14]:
pd.DataFrame({s1.name : s1, s2.name: s2}).index

RangeIndex(start=0, stop=3, step=1)

In [5]:
df = pd.DataFrame({s1.name : s1, s2.name: s2})

In [28]:
df['s2'][0]

'Iago'

In [29]:
df[['s1', 's2']][0:2]

          s1     s2
0  Guilherme   Iago
1      Andre  Filho

In [44]:
df['s3'] = 'NaN'

In [46]:
df

          s1     s2   s3
0  Guilherme   Iago  NaN
1      Andre  Filho  NaN
2      Pedro  Paiva  NaN

In [32]:
df.insert(3, 's3', 'NaN')

In [33]:
del df['Idade']

In [34]:
df

          s1     s2   s3
0  Guilherme   Iago  NaN
1      Andre  Filho  NaN
2      Pedro  Paiva  NaN

In [26]:
x = {'s1': 'Nome', 's2': 'Sobrenome', 's3': 'Idade'}

In [31]:
df.rename(columns = x, inplace = True)

In [70]:
df.loc[[2,1]][['Sobrenome', 'Idade', 'Nome']]

  Sobrenome Idade   Nome
2     Paiva   NaN  Pedro
1     Filho   NaN  Andre

In [82]:
df.iloc[[2,1]][['Sobrenome', 'Idade', 'Nome']]

  Sobrenome Idade   Nome
2     Paiva   NaN  Pedro
1     Filho   NaN  Andre

In [32]:
df

        Nome Sobrenome
0  Guilherme      Iago
1      Andre     Filho
2      Pedro     Paiva

In [8]:
df.to_csv('teste.csv')

In [ ]:
df